Enums/Парсеры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>Парсеры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Инфостарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Стандарт</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФоксКлуб</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/Каналы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Catalog>
		<Properties>
			<Name>Каналы</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Парсер</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Парсеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Гиперссылка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодОбновления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Гиперссылка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Заблокировано</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/Регламент/Ext/Module.bsl
Процедура ПередНачаломРаботыСистемы() Экспорт
	//Юзеры = ПользователиИнформационнойБазы.ПолучитьПользователей();
	//Для Каждого Юзер Из Юзеры Цикл
	//	Юзеры.Удалить(Юзер);
	//КонецЦикла;
	
	тЭлемент = Справочники.Каналы.Инфостарт.ПолучитьОбъект();
	Если тЭлемент.Парсер <> Перечисления.Парсеры.Инфостарт Или ПустаяСтрока(тЭлемент.Гиперссылка) Тогда
		тЭлемент.Парсер				= Перечисления.Парсеры.Инфостарт;
		тЭлемент.Гиперссылка		= "http://infostart.ru/print/";
		тЭлемент.ПериодОбновления	= 1;
	КонецЕсли;
	тСтрока 				= ?(тЭлемент.Гиперссылки.Количество() = 0, тЭлемент.Гиперссылки.Добавить(), тЭлемент.Гиперссылки[0]);
	Если ПустаяСтрока(тСтрока.Гиперссылка) Тогда
		тСтрока.Гиперссылка				= "http://infostart.ru/public/rss/";
	КонецЕсли;
	Если тЭлемент.Модифицированность() Тогда
		тЭлемент.Записать();
	КонецЕсли;
	Если Константы.ОтметитьКакПрочтенноеЧерезСек.Получить() = 0 Тогда
		Константы.ОтметитьКакПрочтенноеЧерезСек.Установить(ОтметитьКакПрочтенноеЧерезСек());
		Константы.ВестиПротоколЗагрузки.Установить(Истина);
	КонецЕсли;
КонецПроцедуры

Функция ОтметитьКакПрочтенноеЧерезСек() Экспорт
	Возврат ?(Константы.ОтметитьКакПрочтенноеЧерезСек.Получить() = 0, 5, Константы.ОтметитьКакПрочтенноеЧерезСек.Получить());
КонецФункции

Процедура ЗагрузкаRSS() Экспорт
	Если ПолучитьИспользованиеЖурналаРегистрации().Найти(УровеньЖурналаРегистрации.Информация) = Неопределено Или ПолучитьИспользованиеЖурналаРегистрации().Найти(УровеньЖурналаРегистрации.Примечание) = Неопределено Тогда
		ЗаписьЖурналаРегистрации("Загрузка RSS", , Метаданные.РегламентныеЗадания.ЗагрузкаRSS);
	КонецЕсли;
	Инфостарт.ЗагрузитьRSS();
КонецПроцедуры

Процедура ФлагиУстановить(Ссылка, Флаг=Ложь) Экспорт
	Объект = Ссылка.ПолучитьОбъект();
	Для Каждого тСтрока Из Объект.Гиперссылки Цикл
		тСтрока.Заблокировано = Флаг;
	КонецЦикла;
	Объект.Записать();
КонецПроцедуры
